RAW_MAPPING = {
    "categories": {
        "1": {
            "id": "1",
            "name": "Продажи, обслуживание клиентов",
            "roleIds": [
                "6",
                "10",
                "51",
                "53",
                "54",
                "57",
                "70",
                "71",
                "83",
                "97",
                "105",
                "106",
                "121",
                "122",
                "129"
            ]
        },
        "10": {
            "id": "10",
            "name": "Транспорт, логистика, перевозки",
            "roleIds": [
                "21",
                "31",
                "39",
                "52",
                "58",
                "67",
                "81",
                "131"
            ]
        },
        "11": {
            "id": "11",
            "name": "Информационные технологии",
            "roleIds": [
                "10",
                "12",
                "25",
                "34",
                "36",
                "73",
                "96",
                "104",
                "107",
                "112",
                "113",
                "114",
                "116",
                "121",
                "124",
                "125",
                "126"
            ]
        },
        "12": {
            "id": "12",
            "name": "Управление персоналом, тренинги",
            "roleIds": [
                "17",
                "38",
                "69",
                "117",
                "118"
            ]
        },
        "13": {
            "id": "13",
            "name": "Юристы",
            "roleIds": [
                "145",
                "146"
            ]
        },
        "14": {
            "id": "14",
            "name": "Закупки",
            "roleIds": [
                "66",
                "119"
            ]
        },
        "15": {
            "id": "15",
            "name": "Безопасность",
            "roleIds": [
                "22",
                "90",
                "95",
                "116",
                "120"
            ]
        },
        "16": {
            "id": "16",
            "name": "Домашний, обслуживающий персонал",
            "roleIds": [
                "8",
                "21",
                "32",
                "58",
                "89",
                "90",
                "130"
            ]
        },
        "17": {
            "id": "17",
            "name": "Рабочий персонал",
            "roleIds": [
                "5",
                "21",
                "31",
                "52",
                "59",
                "63",
                "78",
                "85",
                "86",
                "102",
                "109",
                "111",
                "115",
                "128",
                "131",
                "143"
            ]
        },
        "18": {
            "id": "18",
            "name": "Строительство, недвижимость",
            "roleIds": [
                "6",
                "14",
                "27",
                "30",
                "34",
                "47",
                "46",
                "59",
                "63",
                "78",
                "100",
                "102",
                "108",
                "109",
                "115",
                "143"
            ]
        },
        "19": {
            "id": "19",
            "name": "Автомобильный бизнес",
            "roleIds": [
                "4",
                "5",
                "62",
                "70"
            ]
        },
        "2": {
            "id": "2",
            "name": "Розничная торговля",
            "roleIds": [
                "9",
                "35",
                "77",
                "97",
                "99",
                "123",
                "127"
            ]
        },
        "20": {
            "id": "20",
            "name": "Туризм, гостиницы, рестораны",
            "roleIds": [
                "8",
                "72",
                "74",
                "89",
                "94",
                "130",
                "140"
            ]
        },
        "21": {
            "id": "21",
            "name": "Спортивные клубы, фитнес, салоны красоты",
            "roleIds": [
                "8",
                "56",
                "60",
                "61",
                "70",
                "92",
                "138"
            ]
        },
        "22": {
            "id": "22",
            "name": "Страхование",
            "roleIds": [
                "11",
                "91",
                "122"
            ]
        },
        "23": {
            "id": "23",
            "name": "Медицина, фармацевтика",
            "roleIds": [
                "8",
                "15",
                "19",
                "24",
                "29",
                "42",
                "64",
                "65",
                "133"
            ]
        },
        "24": {
            "id": "24",
            "name": "Искусство, развлечения, масс-медиа",
            "roleIds": [
                "12",
                "13",
                "20",
                "25",
                "34",
                "41",
                "55",
                "98",
                "103",
                "139"
            ]
        },
        "25": {
            "id": "25",
            "name": "Наука, образование",
            "roleIds": [
                "17",
                "23",
                "79",
                "101",
                "132"
            ]
        },
        "26": {
            "id": "26",
            "name": "Высший менеджмент",
            "roleIds": [
                "26",
                "36",
                "37",
                "38",
                "53",
                "80",
                "87",
                "125",
                "135"
            ]
        },
        "27": {
            "id": "27",
            "name": "Другое",
            "roleIds": [
                "40"
            ]
        },
        "3": {
            "id": "3",
            "name": "Финансы, бухгалтерия",
            "roleIds": [
                "16",
                "18",
                "50",
                "134",
                "135",
                "136",
                "137",
                "142"
            ]
        },
        "4": {
            "id": "4",
            "name": "Стратегия, инвестиции, консалтинг",
            "roleIds": [
                "10",
                "75",
                "107",
                "134"
            ]
        },
        "5": {
            "id": "5",
            "name": "Административный персонал",
            "roleIds": [
                "8",
                "33",
                "58",
                "76",
                "84",
                "88",
                "93",
                "110"
            ]
        },
        "6": {
            "id": "6",
            "name": "Маркетинг, реклама, PR",
            "roleIds": [
                "1",
                "2",
                "3",
                "10",
                "12",
                "34",
                "37",
                "55",
                "68",
                "70",
                "71",
                "99"
            ]
        },
        "7": {
            "id": "7",
            "name": "Производство, сервисное обслуживание",
            "roleIds": [
                "44",
                "45",
                "46",
                "48",
                "49",
                "63",
                "79",
                "80",
                "82",
                "85",
                "86",
                "109",
                "111",
                "115",
                "128",
                "141",
                "143",
                "144"
            ]
        },
        "8": {
            "id": "8",
            "name": "Добыча сырья",
            "roleIds": [
                "27",
                "28",
                "49",
                "63",
                "79"
            ]
        },
        "9": {
            "id": "9",
            "name": "Сельское хозяйство",
            "roleIds": [
                "7",
                "19",
                "43",
                "49",
                "63"
            ]
        }
    },
    "categoryIdsSorted": [
        "19",
        "5",
        "15",
        "26",
        "8",
        "16",
        "14",
        "11",
        "24",
        "6",
        "23",
        "25",
        "1",
        "7",
        "17",
        "2",
        "9",
        "21",
        "4",
        "22",
        "18",
        "10",
        "20",
        "12",
        "3",
        "13",
        "27"
    ],
    "roles": {
        "1": {
            "id": "1",
            "name": "Event-менеджер"
        },
        "10": {
            "id": "10",
            "name": "Аналитик"
        },
        "100": {
            "id": "100",
            "name": "Прораб, мастер СМР"
        },
        "101": {
            "id": "101",
            "name": "Психолог"
        },
        "102": {
            "id": "102",
            "name": "Разнорабочий"
        },
        "103": {
            "id": "103",
            "name": "Режиссер, сценарист"
        },
        "104": {
            "id": "104",
            "name": "Руководитель группы разработки"
        },
        "105": {
            "id": "105",
            "name": "Руководитель отдела клиентского обслуживания"
        },
        "106": {
            "id": "106",
            "name": "Руководитель отдела продаж"
        },
        "107": {
            "id": "107",
            "name": "Руководитель проектов"
        },
        "108": {
            "id": "108",
            "name": "Руководитель строительного проекта"
        },
        "109": {
            "id": "109",
            "name": "Сварщик"
        },
        "11": {
            "id": "11",
            "name": "Андеррайтер"
        },
        "110": {
            "id": "110",
            "name": "Секретарь, помощник руководителя, ассистент"
        },
        "111": {
            "id": "111",
            "name": "Сервисный инженер, механик"
        },
        "112": {
            "id": "112",
            "name": "Сетевой инженер"
        },
        "113": {
            "id": "113",
            "name": "Системный администратор"
        },
        "114": {
            "id": "114",
            "name": "Системный инженер"
        },
        "115": {
            "id": "115",
            "name": "Слесарь"
        },
        "116": {
            "id": "116",
            "name": "Специалист по информационной безопасности"
        },
        "117": {
            "id": "117",
            "name": "Специалист по кадрам"
        },
        "118": {
            "id": "118",
            "name": "Специалист по подбору персонала"
        },
        "119": {
            "id": "119",
            "name": "Специалист по тендерам"
        },
        "12": {
            "id": "12",
            "name": "Арт-директор, креативный директор"
        },
        "120": {
            "id": "120",
            "name": "Специалист службы безопасности"
        },
        "121": {
            "id": "121",
            "name": "Специалист технической поддержки"
        },
        "122": {
            "id": "122",
            "name": "Страховой агент"
        },
        "123": {
            "id": "123",
            "name": "Супервайзер"
        },
        "124": {
            "id": "124",
            "name": "Тестировщик"
        },
        "125": {
            "id": "125",
            "name": "Технический директор (CTO)"
        },
        "126": {
            "id": "126",
            "name": "Технический писатель"
        },
        "127": {
            "id": "127",
            "name": "Товаровед"
        },
        "128": {
            "id": "128",
            "name": "Токарь, фрезеровщик, шлифовщик"
        },
        "129": {
            "id": "129",
            "name": "Торговый представитель"
        },
        "13": {
            "id": "13",
            "name": "Артист, актер, аниматор"
        },
        "130": {
            "id": "130",
            "name": "Уборщица, уборщик"
        },
        "131": {
            "id": "131",
            "name": "Упаковщик, комплектовщик"
        },
        "132": {
            "id": "132",
            "name": "Учитель, преподаватель, педагог"
        },
        "133": {
            "id": "133",
            "name": "Фармацевт-провизор"
        },
        "134": {
            "id": "134",
            "name": "Финансовый аналитик, инвестиционный аналитик"
        },
        "135": {
            "id": "135",
            "name": "Финансовый директор (CFO)"
        },
        "136": {
            "id": "136",
            "name": "Финансовый контролер"
        },
        "137": {
            "id": "137",
            "name": "Финансовый менеджер"
        },
        "138": {
            "id": "138",
            "name": "Фитнес-тренер, инструктор тренажерного зала"
        },
        "139": {
            "id": "139",
            "name": "Фотограф, ретушер"
        },
        "14": {
            "id": "14",
            "name": "Архитектор"
        },
        "140": {
            "id": "140",
            "name": "Хостес"
        },
        "141": {
            "id": "141",
            "name": "Швея, портной, закройщик"
        },
        "142": {
            "id": "142",
            "name": "Экономист"
        },
        "143": {
            "id": "143",
            "name": "Электромонтажник"
        },
        "144": {
            "id": "144",
            "name": "Энергетик"
        },
        "145": {
            "id": "145",
            "name": "Юрисконсульт"
        },
        "146": {
            "id": "146",
            "name": "Юрист"
        },
        "15": {
            "id": "15",
            "name": "Ассистент врача"
        },
        "16": {
            "id": "16",
            "name": "Аудитор"
        },
        "17": {
            "id": "17",
            "name": "Бизнес-тренер"
        },
        "18": {
            "id": "18",
            "name": "Бухгалтер"
        },
        "19": {
            "id": "19",
            "name": "Ветеринарный врач"
        },
        "2": {
            "id": "2",
            "name": "PR-менеджер"
        },
        "20": {
            "id": "20",
            "name": "Видеооператор, видеомонтажер"
        },
        "21": {
            "id": "21",
            "name": "Водитель"
        },
        "22": {
            "id": "22",
            "name": "Военнослужащий"
        },
        "23": {
            "id": "23",
            "name": "Воспитатель, няня"
        },
        "24": {
            "id": "24",
            "name": "Врач"
        },
        "25": {
            "id": "25",
            "name": "Гейм-дизайнер"
        },
        "26": {
            "id": "26",
            "name": "Генеральный директор, исполнительный директор (CEO)"
        },
        "27": {
            "id": "27",
            "name": "Геодезист"
        },
        "28": {
            "id": "28",
            "name": "Геолог"
        },
        "29": {
            "id": "29",
            "name": "Главный врач, заведующий отделением"
        },
        "3": {
            "id": "3",
            "name": "SMM-менеджер, контент-менеджер"
        },
        "30": {
            "id": "30",
            "name": "Главный инженер проекта"
        },
        "31": {
            "id": "31",
            "name": "Грузчик"
        },
        "32": {
            "id": "32",
            "name": "Дворник"
        },
        "33": {
            "id": "33",
            "name": "Делопроизводитель, архивариус"
        },
        "34": {
            "id": "34",
            "name": "Дизайнер, художник"
        },
        "35": {
            "id": "35",
            "name": "Директор магазина, директор сети магазинов"
        },
        "36": {
            "id": "36",
            "name": "Директор по информационным технологиям (CIO)"
        },
        "37": {
            "id": "37",
            "name": "Директор по маркетингу и PR (CMO)"
        },
        "38": {
            "id": "38",
            "name": "Директор по персоналу (HRD)"
        },
        "39": {
            "id": "39",
            "name": "Диспетчер"
        },
        "4": {
            "id": "4",
            "name": "Автомойщик"
        },
        "40": {
            "id": "40",
            "name": "Другое"
        },
        "41": {
            "id": "41",
            "name": "Журналист, корреспондент"
        },
        "42": {
            "id": "42",
            "name": "Заведующий аптекой"
        },
        "43": {
            "id": "43",
            "name": "Зоотехник"
        },
        "44": {
            "id": "44",
            "name": "Инженер по качеству"
        },
        "45": {
            "id": "45",
            "name": "Инженер по охране труда и технике безопасности"
        },
        "46": {
            "id": "46",
            "name": "Инженер по эксплуатации"
        },
        "47": {
            "id": "47",
            "name": "Инженер ПТО, инженер-сметчик"
        },
        "48": {
            "id": "48",
            "name": "Инженер-конструктор, инженер-проектировщик"
        },
        "49": {
            "id": "49",
            "name": "Инженер-технолог"
        },
        "5": {
            "id": "5",
            "name": "Автослесарь, автомеханик"
        },
        "50": {
            "id": "50",
            "name": "Казначей"
        },
        "51": {
            "id": "51",
            "name": "Кассир-операционист"
        },
        "52": {
            "id": "52",
            "name": "Кладовщик"
        },
        "53": {
            "id": "53",
            "name": "Коммерческий директор (CCO)"
        },
        "54": {
            "id": "54",
            "name": "Координатор отдела продаж"
        },
        "55": {
            "id": "55",
            "name": "Копирайтер, редактор, корректор"
        },
        "56": {
            "id": "56",
            "name": "Косметолог"
        },
        "57": {
            "id": "57",
            "name": "Кредитный специалист"
        },
        "58": {
            "id": "58",
            "name": "Курьер"
        },
        "59": {
            "id": "59",
            "name": "Маляр, штукатур"
        },
        "6": {
            "id": "6",
            "name": "Агент по недвижимости"
        },
        "60": {
            "id": "60",
            "name": "Массажист"
        },
        "61": {
            "id": "61",
            "name": "Мастер ногтевого сервиса"
        },
        "62": {
            "id": "62",
            "name": "Мастер-приемщик"
        },
        "63": {
            "id": "63",
            "name": "Машинист"
        },
        "64": {
            "id": "64",
            "name": "Медицинская сестра"
        },
        "65": {
            "id": "65",
            "name": "Медицинский представитель"
        },
        "66": {
            "id": "66",
            "name": "Менеджер по закупкам"
        },
        "67": {
            "id": "67",
            "name": "Менеджер по логистике, менеджер по ВЭД"
        },
        "68": {
            "id": "68",
            "name": "Менеджер по маркетингу и рекламе"
        },
        "69": {
            "id": "69",
            "name": "Менеджер по персоналу"
        },
        "7": {
            "id": "7",
            "name": "Агроном"
        },
        "70": {
            "id": "70",
            "name": "Менеджер по продажам, менеджер по работе с клиентами"
        },
        "71": {
            "id": "71",
            "name": "Менеджер по работе с партнерами"
        },
        "72": {
            "id": "72",
            "name": "Менеджер по туризму"
        },
        "73": {
            "id": "73",
            "name": "Менеджер продукта"
        },
        "74": {
            "id": "74",
            "name": "Менеджер ресторана"
        },
        "75": {
            "id": "75",
            "name": "Менеджер/консультант по стратегии"
        },
        "76": {
            "id": "76",
            "name": "Менеджер/руководитель АХО"
        },
        "77": {
            "id": "77",
            "name": "Мерчендайзер"
        },
        "78": {
            "id": "78",
            "name": "Монтажник"
        },
        "79": {
            "id": "79",
            "name": "Научный специалист, исследователь, лаборант"
        },
        "8": {
            "id": "8",
            "name": "Администратор"
        },
        "80": {
            "id": "80",
            "name": "Начальник производства"
        },
        "81": {
            "id": "81",
            "name": "Начальник склада"
        },
        "82": {
            "id": "82",
            "name": "Начальник смены, мастер участка"
        },
        "83": {
            "id": "83",
            "name": "Оператор call-центра, специалист контактного центра"
        },
        "84": {
            "id": "84",
            "name": "Оператор ПК, оператор базы данных"
        },
        "85": {
            "id": "85",
            "name": "Оператор производственной линии"
        },
        "86": {
            "id": "86",
            "name": "Оператор станков с ЧПУ"
        },
        "87": {
            "id": "87",
            "name": "Операционный директор (COO)"
        },
        "88": {
            "id": "88",
            "name": "Офис-менеджер"
        },
        "89": {
            "id": "89",
            "name": "Официант, бармен, бариста"
        },
        "9": {
            "id": "9",
            "name": "Администратор магазина, администратор торгового зала"
        },
        "90": {
            "id": "90",
            "name": "Охранник"
        },
        "91": {
            "id": "91",
            "name": "Оценщик"
        },
        "92": {
            "id": "92",
            "name": "Парикмахер"
        },
        "93": {
            "id": "93",
            "name": "Переводчик"
        },
        "94": {
            "id": "94",
            "name": "Повар, пекарь, кондитер"
        },
        "95": {
            "id": "95",
            "name": "Полицейский"
        },
        "96": {
            "id": "96",
            "name": "Программист, разработчик"
        },
        "97": {
            "id": "97",
            "name": "Продавец-консультант, продавец-кассир"
        },
        "98": {
            "id": "98",
            "name": "Продюсер"
        },
        "99": {
            "id": "99",
            "name": "Промоутер"
        }
    }
}

ROLES_TREE = {
    "categories": [
        {
            "id": "category-19",
            "text": "Автомобильный бизнес",
            "items": [
                {"id": "4", "text": "Автомойщик"},
                {"id": "5", "text": "Автослесарь, автомеханик"},
                {"id": "62", "text": "Мастер-приемщик"},
                {
                    "id": "70",
                    "text": "Менеджер по продажам, менеджер по работе с клиентами",
                },
            ],
        },
        {
            "id": "category-5",
            "text": "Административный персонал",
            "items": [
                {"id": "8", "text": "Администратор"},
                {"id": "33", "text": "Делопроизводитель, архивариус"},
                {"id": "58", "text": "Курьер"},
                {"id": "76", "text": "Менеджер/руководитель АХО"},
                {"id": "84", "text": "Оператор ПК, оператор базы данных"},
                {"id": "88", "text": "Офис-менеджер"},
                {"id": "93", "text": "Переводчик"},
                {"id": "110", "text": "Секретарь, помощник руководителя, ассистент"},
            ],
        },
        {
            "id": "category-15",
            "text": "Безопасность",
            "items": [
                {"id": "22", "text": "Военнослужащий"},
                {"id": "90", "text": "Охранник"},
                {"id": "95", "text": "Полицейский"},
                {"id": "116", "text": "Специалист по информационной безопасности"},
                {"id": "120", "text": "Специалист службы безопасности"},
            ],
        },
        {
            "id": "category-26",
            "text": "Высший менеджмент",
            "items": [
                {
                    "id": "26",
                    "text": "Генеральный директор, исполнительный директор (CEO)",
                },
                {"id": "36", "text": "Директор по информационным технологиям (CIO)"},
                {"id": "37", "text": "Директор по маркетингу и PR (CMO)"},
                {"id": "38", "text": "Директор по персоналу (HRD)"},
                {"id": "53", "text": "Коммерческий директор (CCO)"},
                {"id": "80", "text": "Начальник производства"},
                {"id": "87", "text": "Операционный директор (COO)"},
                {"id": "125", "text": "Технический директор (CTO)"},
                {"id": "135", "text": "Финансовый директор (CFO)"},
            ],
        },
        {
            "id": "category-8",
            "text": "Добыча сырья",
            "items": [
                {"id": "27", "text": "Геодезист"},
                {"id": "28", "text": "Геолог"},
                {"id": "49", "text": "Инженер-технолог"},
                {"id": "63", "text": "Машинист"},
                {"id": "79", "text": "Научный специалист, исследователь, лаборант"},
            ],
        },
        {
            "id": "category-16",
            "text": "Домашний, обслуживающий персонал",
            "items": [
                {"id": "8", "text": "Администратор"},
                {"id": "21", "text": "Водитель"},
                {"id": "32", "text": "Дворник"},
                {"id": "58", "text": "Курьер"},
                {"id": "89", "text": "Официант, бармен, бариста"},
                {"id": "90", "text": "Охранник"},
                {"id": "130", "text": "Уборщица, уборщик"},
            ],
        },
        {
            "id": "category-14",
            "text": "Закупки",
            "items": [
                {"id": "66", "text": "Менеджер по закупкам"},
                {"id": "119", "text": "Специалист по тендерам"},
            ],
        },
        {
            "id": "category-11",
            "text": "Информационные технологии",
            "items": [
                {"id": "10", "text": "Аналитик"},
                {"id": "12", "text": "Арт-директор, креативный директор"},
                {"id": "25", "text": "Гейм-дизайнер"},
                {"id": "34", "text": "Дизайнер, художник"},
                {"id": "36", "text": "Директор по информационным технологиям (CIO)"},
                {"id": "73", "text": "Менеджер продукта"},
                {"id": "96", "text": "Программист, разработчик"},
                {"id": "104", "text": "Руководитель группы разработки"},
                {"id": "107", "text": "Руководитель проектов"},
                {"id": "112", "text": "Сетевой инженер"},
                {"id": "113", "text": "Системный администратор"},
                {"id": "114", "text": "Системный инженер"},
                {"id": "116", "text": "Специалист по информационной безопасности"},
                {"id": "121", "text": "Специалист технической поддержки"},
                {"id": "124", "text": "Тестировщик"},
                {"id": "125", "text": "Технический директор (CTO)"},
                {"id": "126", "text": "Технический писатель"},
            ],
        },
        {
            "id": "category-24",
            "text": "Искусство, развлечения, масс-медиа",
            "items": [
                {"id": "12", "text": "Арт-директор, креативный директор"},
                {"id": "13", "text": "Артист, актер, аниматор"},
                {"id": "20", "text": "Видеооператор, видеомонтажер"},
                {"id": "25", "text": "Гейм-дизайнер"},
                {"id": "34", "text": "Дизайнер, художник"},
                {"id": "41", "text": "Журналист, корреспондент"},
                {"id": "55", "text": "Копирайтер, редактор, корректор"},
                {"id": "98", "text": "Продюсер"},
                {"id": "103", "text": "Режиссер, сценарист"},
                {"id": "139", "text": "Фотограф, ретушер"},
            ],
        },
        {
            "id": "category-6",
            "text": "Маркетинг, реклама, PR",
            "items": [
                {"id": "1", "text": "Event-менеджер"},
                {"id": "2", "text": "PR-менеджер"},
                {"id": "3", "text": "SMM-менеджер, контент-менеджер"},
                {"id": "10", "text": "Аналитик"},
                {"id": "12", "text": "Арт-директор, креативный директор"},
                {"id": "34", "text": "Дизайнер, художник"},
                {"id": "37", "text": "Директор по маркетингу и PR (CMO)"},
                {"id": "55", "text": "Копирайтер, редактор, корректор"},
                {"id": "68", "text": "Менеджер по маркетингу и рекламе"},
                {
                    "id": "70",
                    "text": "Менеджер по продажам, менеджер по работе с клиентами",
                },
                {"id": "71", "text": "Менеджер по работе с партнерами"},
                {"id": "99", "text": "Промоутер"},
            ],
        },
        {
            "id": "category-23",
            "text": "Медицина, фармацевтика",
            "items": [
                {"id": "8", "text": "Администратор"},
                {"id": "15", "text": "Ассистент врача"},
                {"id": "19", "text": "Ветеринарный врач"},
                {"id": "24", "text": "Врач"},
                {"id": "29", "text": "Главный врач, заведующий отделением"},
                {"id": "42", "text": "Заведующий аптекой"},
                {"id": "64", "text": "Медицинская сестра"},
                {"id": "65", "text": "Медицинский представитель"},
                {"id": "133", "text": "Фармацевт-провизор"},
            ],
        },
        {
            "id": "category-25",
            "text": "Наука, образование",
            "items": [
                {"id": "17", "text": "Бизнес-тренер"},
                {"id": "23", "text": "Воспитатель, няня"},
                {"id": "79", "text": "Научный специалист, исследователь, лаборант"},
                {"id": "101", "text": "Психолог"},
                {"id": "132", "text": "Учитель, преподаватель, педагог"},
            ],
        },
        {
            "id": "category-1",
            "text": "Продажи, обслуживание клиентов",
            "items": [
                {"id": "6", "text": "Агент по недвижимости"},
                {"id": "10", "text": "Аналитик"},
                {"id": "51", "text": "Кассир-операционист"},
                {"id": "53", "text": "Коммерческий директор (CCO)"},
                {"id": "54", "text": "Координатор отдела продаж"},
                {"id": "57", "text": "Кредитный специалист"},
                {
                    "id": "70",
                    "text": "Менеджер по продажам, менеджер по работе с клиентами",
                },
                {"id": "71", "text": "Менеджер по работе с партнерами"},
                {
                    "id": "83",
                    "text": "Оператор call-центра, специалист контактного центра",
                },
                {"id": "97", "text": "Продавец-консультант, продавец-кассир"},
                {"id": "105", "text": "Руководитель отдела клиентского обслуживания"},
                {"id": "106", "text": "Руководитель отдела продаж"},
                {"id": "121", "text": "Специалист технической поддержки"},
                {"id": "122", "text": "Страховой агент"},
                {"id": "129", "text": "Торговый представитель"},
            ],
        },
        {
            "id": "category-7",
            "text": "Производство, сервисное обслуживание",
            "items": [
                {"id": "44", "text": "Инженер по качеству"},
                {"id": "45", "text": "Инженер по охране труда и технике безопасности"},
                {"id": "46", "text": "Инженер по эксплуатации"},
                {"id": "48", "text": "Инженер-конструктор, инженер-проектировщик"},
                {"id": "49", "text": "Инженер-технолог"},
                {"id": "63", "text": "Машинист"},
                {"id": "79", "text": "Научный специалист, исследователь, лаборант"},
                {"id": "80", "text": "Начальник производства"},
                {"id": "82", "text": "Начальник смены, мастер участка"},
                {"id": "85", "text": "Оператор производственной линии"},
                {"id": "86", "text": "Оператор станков с ЧПУ"},
                {"id": "109", "text": "Сварщик"},
                {"id": "111", "text": "Сервисный инженер, механик"},
                {"id": "115", "text": "Слесарь"},
                {"id": "128", "text": "Токарь, фрезеровщик, шлифовщик"},
                {"id": "141", "text": "Швея, портной, закройщик"},
                {"id": "143", "text": "Электромонтажник"},
                {"id": "144", "text": "Энергетик"},
            ],
        },
        {
            "id": "category-17",
            "text": "Рабочий персонал",
            "items": [
                {"id": "5", "text": "Автослесарь, автомеханик"},
                {"id": "21", "text": "Водитель"},
                {"id": "31", "text": "Грузчик"},
                {"id": "52", "text": "Кладовщик"},
                {"id": "59", "text": "Маляр, штукатур"},
                {"id": "63", "text": "Машинист"},
                {"id": "78", "text": "Монтажник"},
                {"id": "85", "text": "Оператор производственной линии"},
                {"id": "86", "text": "Оператор станков с ЧПУ"},
                {"id": "102", "text": "Разнорабочий"},
                {"id": "109", "text": "Сварщик"},
                {"id": "111", "text": "Сервисный инженер, механик"},
                {"id": "115", "text": "Слесарь"},
                {"id": "128", "text": "Токарь, фрезеровщик, шлифовщик"},
                {"id": "131", "text": "Упаковщик, комплектовщик"},
                {"id": "143", "text": "Электромонтажник"},
            ],
        },
        {
            "id": "category-2",
            "text": "Розничная торговля",
            "items": [
                {
                    "id": "9",
                    "text": "Администратор магазина, администратор торгового зала",
                },
                {"id": "35", "text": "Директор магазина, директор сети магазинов"},
                {"id": "77", "text": "Мерчендайзер"},
                {"id": "97", "text": "Продавец-консультант, продавец-кассир"},
                {"id": "99", "text": "Промоутер"},
                {"id": "123", "text": "Супервайзер"},
                {"id": "127", "text": "Товаровед"},
            ],
        },
        {
            "id": "category-9",
            "text": "Сельское хозяйство",
            "items": [
                {"id": "7", "text": "Агроном"},
                {"id": "19", "text": "Ветеринарный врач"},
                {"id": "43", "text": "Зоотехник"},
                {"id": "49", "text": "Инженер-технолог"},
                {"id": "63", "text": "Машинист"},
            ],
        },
        {
            "id": "category-21",
            "text": "Спортивные клубы, фитнес, салоны красоты",
            "items": [
                {"id": "8", "text": "Администратор"},
                {"id": "56", "text": "Косметолог"},
                {"id": "60", "text": "Массажист"},
                {"id": "61", "text": "Мастер ногтевого сервиса"},
                {
                    "id": "70",
                    "text": "Менеджер по продажам, менеджер по работе с клиентами",
                },
                {"id": "92", "text": "Парикмахер"},
                {"id": "138", "text": "Фитнес-тренер, инструктор тренажерного зала"},
            ],
        },
        {
            "id": "category-4",
            "text": "Стратегия, инвестиции, консалтинг",
            "items": [
                {"id": "10", "text": "Аналитик"},
                {"id": "75", "text": "Менеджер/консультант по стратегии"},
                {"id": "107", "text": "Руководитель проектов"},
                {"id": "134", "text": "Финансовый аналитик, инвестиционный аналитик"},
            ],
        },
        {
            "id": "category-22",
            "text": "Страхование",
            "items": [
                {"id": "11", "text": "Андеррайтер"},
                {"id": "91", "text": "Оценщик"},
                {"id": "122", "text": "Страховой агент"},
            ],
        },
        {
            "id": "category-18",
            "text": "Строительство, недвижимость",
            "items": [
                {"id": "6", "text": "Агент по недвижимости"},
                {"id": "14", "text": "Архитектор"},
                {"id": "27", "text": "Геодезист"},
                {"id": "30", "text": "Главный инженер проекта"},
                {"id": "34", "text": "Дизайнер, художник"},
                {"id": "47", "text": "Инженер ПТО, инженер-сметчик"},
                {"id": "46", "text": "Инженер по эксплуатации"},
                {"id": "59", "text": "Маляр, штукатур"},
                {"id": "63", "text": "Машинист"},
                {"id": "78", "text": "Монтажник"},
                {"id": "100", "text": "Прораб, мастер СМР"},
                {"id": "102", "text": "Разнорабочий"},
                {"id": "108", "text": "Руководитель строительного проекта"},
                {"id": "109", "text": "Сварщик"},
                {"id": "115", "text": "Слесарь"},
                {"id": "143", "text": "Электромонтажник"},
            ],
        },
        {
            "id": "category-10",
            "text": "Транспорт, логистика, перевозки",
            "items": [
                {"id": "21", "text": "Водитель"},
                {"id": "31", "text": "Грузчик"},
                {"id": "39", "text": "Диспетчер"},
                {"id": "52", "text": "Кладовщик"},
                {"id": "58", "text": "Курьер"},
                {"id": "67", "text": "Менеджер по логистике, менеджер по ВЭД"},
                {"id": "81", "text": "Начальник склада"},
                {"id": "131", "text": "Упаковщик, комплектовщик"},
            ],
        },
        {
            "id": "category-20",
            "text": "Туризм, гостиницы, рестораны",
            "items": [
                {"id": "8", "text": "Администратор"},
                {"id": "72", "text": "Менеджер по туризму"},
                {"id": "74", "text": "Менеджер ресторана"},
                {"id": "89", "text": "Официант, бармен, бариста"},
                {"id": "94", "text": "Повар, пекарь, кондитер"},
                {"id": "130", "text": "Уборщица, уборщик"},
                {"id": "140", "text": "Хостес"},
            ],
        },
        {
            "id": "category-12",
            "text": "Управление персоналом, тренинги",
            "items": [
                {"id": "17", "text": "Бизнес-тренер"},
                {"id": "38", "text": "Директор по персоналу (HRD)"},
                {"id": "69", "text": "Менеджер по персоналу"},
                {"id": "117", "text": "Специалист по кадрам"},
                {"id": "118", "text": "Специалист по подбору персонала"},
            ],
        },
        {
            "id": "category-3",
            "text": "Финансы, бухгалтерия",
            "items": [
                {"id": "16", "text": "Аудитор"},
                {"id": "18", "text": "Бухгалтер"},
                {"id": "50", "text": "Казначей"},
                {"id": "134", "text": "Финансовый аналитик, инвестиционный аналитик"},
                {"id": "135", "text": "Финансовый директор (CFO)"},
                {"id": "136", "text": "Финансовый контролер"},
                {"id": "137", "text": "Финансовый менеджер"},
                {"id": "142", "text": "Экономист"},
            ],
        },
        {
            "id": "category-13",
            "text": "Юристы",
            "items": [
                {"id": "145", "text": "Юрисконсульт"},
                {"id": "146", "text": "Юрист"},
            ],
        },
        {
            "id": "category-27",
            "text": "Другое",
            "items": [{"id": "40", "text": "Другое"}],
        },
    ]
}
